# Terraform environment test
#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1jMjE3YTNlYS00MDJmLTQ4ODYtYWNlNS00NzhkYjcyYWI0Yzk7b2JqZWN0SWQ9Y2M3NWExY2MtZDZhMS00NTMwLTgyOGYtODY4MzJjZTkxYjliO3N1YnNjcmlwdGlvbklkPTM3YmFjNjNhLWI5NjQtNDZiMi04ZGU4LWJhOTNjNDMyZWExZjt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
module.observability.data.azurerm_client_config.current: Reading...
module.observability.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1jMjE3YTNlYS00MDJmLTQ4ODYtYWNlNS00NzhkYjcyYWI0Yzk7b2JqZWN0SWQ9Y2M3NWExY2MtZDZhMS00NTMwLTgyOGYtODY4MzJjZTkxYjliO3N1YnNjcmlwdGlvbklkPTM3YmFjNjNhLWI5NjQtNDZiMi04ZGU4LWJhOTNjNDMyZWExZjt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.infra-resources.azapi_resource.eso will be created
  + resource "azapi_resource" "eso" {
      + body                      = {
          + properties = {
              + kustomizations             = {
                  + external-secrets-operator = {
                      + force                  = false
                      + path                   = "./"
                      + prune                  = false
                      + retryIntervalInSeconds = 300
                      + syncIntervalInSeconds  = 300
                      + timeoutInSeconds       = 300
                      + wait                   = true
                    }
                }
              + namespace                  = "flux-system"
              + ociRepository              = {
                  + insecure              = false
                  + repositoryRef         = {
                      + tag = "at_ring2"
                    }
                  + syncIntervalInSeconds = 300
                  + timeoutInSeconds      = 300
                  + url                   = "oci://altinncr.azurecr.io/manifests/infra/external-secrets-operator"
                  + useWorkloadIdentity   = true
                }
              + reconciliationWaitDuration = "PT5M"
              + sourceKind                 = "OCIRepository"
              + waitForReconciliation      = true
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + name                      = "external-secrets-operator"
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/auth-at22-aks-rg/providers/Microsoft.ContainerService/managedClusters/auth-at22-aks"
      + schema_validation_enabled = true
      + sensitive_body            = (write-only attribute)
      + type                      = "Microsoft.KubernetesConfiguration/fluxConfigurations@2024-11-01"
    }

  # module.infra-resources.azapi_resource.otel_collector will be updated in-place
  ~ resource "azapi_resource" "otel_collector" {
      ~ body                      = {
          ~ properties = {
              ~ kustomizations             = {
                  ~ otel-collector = {
                      + postBuild              = {
                          + substitute = {
                              + CLIENT_ID = (known after apply)
                              + KV_URI    = (known after apply)
                              + TENANT_ID = (sensitive value)
                            }
                        }
                        # (7 unchanged attributes hidden)
                    }
                }
                # (5 unchanged attributes hidden)
            }
        }
        id                        = "/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/auth-at22-aks-rg/providers/Microsoft.ContainerService/managedClusters/auth-at22-aks/providers/Microsoft.KubernetesConfiguration/fluxConfigurations/otel-collector"
      + location                  = (known after apply)
        name                      = "otel-collector"
      ~ output                    = {
          - id         = "/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/auth-at22-aks-rg/providers/Microsoft.ContainerService/managedClusters/auth-at22-aks/providers/Microsoft.KubernetesConfiguration/fluxConfigurations/otel-collector"
          - properties = {
              - complianceState      = "Compliant"
              - errorMessage         = ""
              - kustomizations       = {
                  - otel-collector = {
                      - name = "otel-collector"
                    }
                }
              - provisioningState    = "Succeeded"
              - repositoryPublicKey  = ""
              - sourceSyncedCommitId = "at_ring2@sha256:589d6bec2944450e4b7879a67186c8ae2bffb77a34412f6fdc6278b31b0d2090"
              - sourceUpdatedAt      = "2025-05-15T13:00:26+00:00"
              - statusUpdatedAt      = "2025-05-15T13:20:00.651+00:00"
              - statuses             = [
                  - {
                      - statusConditions = [
                          - {},
                          - {},
                        ]
                    },
                  - {
                      - statusConditions = [
                          - {},
                          - {},
                        ]
                    },
                ]
            }
          - type       = "Microsoft.KubernetesConfiguration/fluxConfigurations"
        } -> (known after apply)
      + tags                      = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.observability.azuread_application.app will be created
  + resource "azuread_application" "app" {
      + app_role_ids                = (known after apply)
      + client_id                   = (known after apply)
      + disabled_by_microsoft       = (known after apply)
      + display_name                = "auth-at22-otel-collector"
      + id                          = (known after apply)
      + logo_url                    = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + object_id                   = (known after apply)
      + prevent_duplicate_names     = false
      + publisher_domain            = (known after apply)
      + sign_in_audience            = "AzureADMyOrg"
      + tags                        = (known after apply)
      + template_id                 = (known after apply)

      + feature_tags (known after apply)
    }

  # module.observability.azuread_application_federated_identity_credential.obs_fed_identity will be created
  + resource "azuread_application_federated_identity_credential" "obs_fed_identity" {
      + application_id = (known after apply)
      + audiences      = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id  = (known after apply)
      + description    = "The federated identity used to federate K8s with Azure AD for auth-at22-otel"
      + display_name   = "fed-identity-auth-at22-obs"
      + id             = (known after apply)
      + issuer         = "https://norwayeast.oic.prod-aks.azure.com/cd0026d8-283b-4a55-9bfa-d0ef4a8ba21c/f28854d8-7e35-4b52-98c3-ee47ac0ec5fc/"
      + subject        = "system:serviceaccount:monitoring:otel-collector"
    }

  # module.observability.azuread_application_password.app will be created
  + resource "azuread_application_password" "app" {
      + application_id      = (known after apply)
      + display_name        = (known after apply)
      + end_date            = (known after apply)
      + id                  = (known after apply)
      + key_id              = (known after apply)
      + rotate_when_changed = (known after apply)
      + start_date          = (known after apply)
      + value               = (sensitive value)
    }

  # module.observability.azuread_service_principal.sp will be created
  + resource "azuread_service_principal" "sp" {
      + account_enabled             = true
      + app_role_ids                = (known after apply)
      + app_roles                   = (known after apply)
      + application_tenant_id       = (known after apply)
      + client_id                   = (known after apply)
      + display_name                = (known after apply)
      + homepage_url                = (known after apply)
      + id                          = (known after apply)
      + logout_url                  = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + oauth2_permission_scopes    = (known after apply)
      + object_id                   = (known after apply)
      + redirect_uris               = (known after apply)
      + saml_metadata_url           = (known after apply)
      + service_principal_names     = (known after apply)
      + sign_in_audience            = (known after apply)
      + tags                        = (known after apply)
      + type                        = (known after apply)

      + feature_tags (known after apply)

      + features (known after apply)
    }

  # module.observability.azuread_service_principal_password.sp will be created
  + resource "azuread_service_principal_password" "sp" {
      + display_name         = (known after apply)
      + end_date             = (known after apply)
      + id                   = (known after apply)
      + key_id               = (known after apply)
      + rotate_when_changed  = (known after apply)
      + service_principal_id = (known after apply)
      + start_date           = (known after apply)
      + value                = (sensitive value)
    }

  # module.observability.azurerm_application_insights.obs will be created
  + resource "azurerm_application_insights" "obs" {
      + app_id                              = (known after apply)
      + application_type                    = "web"
      + connection_string                   = (sensitive value)
      + daily_data_cap_in_gb                = 100
      + disable_ip_masking                  = false
      + force_customer_storage_for_profiler = false
      + id                                  = (known after apply)
      + instrumentation_key                 = (sensitive value)
      + internet_ingestion_enabled          = true
      + internet_query_enabled              = true
      + local_authentication_disabled       = false
      + location                            = "norwayeast"
      + name                                = "auth-at22-obs-appinsights"
      + resource_group_name                 = "auth-at22-obs-rg"
      + retention_in_days                   = 30
      + sampling_percentage                 = 100
      + workspace_id                        = (known after apply)
    }

  # module.observability.azurerm_key_vault.obs_kv will be created
  + resource "azurerm_key_vault" "obs_kv" {
      + access_policy                 = (known after apply)
      + id                            = (known after apply)
      + location                      = "norwayeast"
      + name                          = "obs-auth-at22-kv"
      + public_network_access_enabled = true
      + resource_group_name           = "auth-at22-obs-rg"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 90
      + tenant_id                     = "cd0026d8-283b-4a55-9bfa-d0ef4a8ba21c"
      + vault_uri                     = (known after apply)

      + contact (known after apply)

      + network_acls (known after apply)
    }

  # module.observability.azurerm_key_vault_secret.conn_string will be created
  + resource "azurerm_key_vault_secret" "conn_string" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "connectionString"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.observability.azurerm_log_analytics_workspace.obs will be created
  + resource "azurerm_log_analytics_workspace" "obs" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = false
      + location                        = "norwayeast"
      + name                            = "auth-at22-obs-law"
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "auth-at22-obs-rg"
      + retention_in_days               = 30
      + secondary_shared_key            = (sensitive value)
      + sku                             = (known after apply)
      + workspace_id                    = (known after apply)
    }

  # module.observability.azurerm_monitor_workspace.obs will be created
  + resource "azurerm_monitor_workspace" "obs" {
      + default_data_collection_endpoint_id = (known after apply)
      + default_data_collection_rule_id     = (known after apply)
      + id                                  = (known after apply)
      + location                            = "norwayeast"
      + name                                = "auth-at22-obs-amw"
      + public_network_access_enabled       = true
      + query_endpoint                      = (known after apply)
      + resource_group_name                 = "auth-at22-obs-rg"
    }

  # module.observability.azurerm_resource_group.obs will be created
  + resource "azurerm_resource_group" "obs" {
      + id       = (known after apply)
      + location = "norwayeast"
      + name     = "auth-at22-obs-rg"
    }

  # module.observability.azurerm_role_assignment.obs_kv_reader will be created
  + resource "azurerm_role_assignment" "obs_kv_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = true
    }

  # module.observability.time_rotating.password will be created
  + resource "time_rotating" "password" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 365
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

Plan: 14 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @sduranc |
| Action | `pull_request` |
| Working Directory | `./infrastructure/altinn-auth-test/auth-at22-aks-rg` |
| State File | `github.com/altinn/altinn-platform/environments/test/auth-at22-aks-rg.tfstate` |
| Plan File | `github.com_altinn_altinn-platform_environments_test_auth-at22-aks-rg.tfstate.tfplan`